// 브론즈 
// 어떤 값을 받으면 값을 출력해주는 함수
const print = (value) => {

}
print("안녕하세요")

// 3개의 정수를 빼주는 함수

// 실버
// 홍길동을 n번 출력해주는 함수

// 골드
// 1 ~ n까지 홀수만 출력해주는 함수


// 문자열을 입력받고 원하는 문자의 개수를 구해주는 함수
// ex) getCount("abcabc", "a") -> return 2

// 플레티넘
// 한글을 정수로 바꿔주는 함수 (일공이사 -> 1024)


// 정수를 한글로 바꿔주는 함수 ("1024" -> 일공이사)

// ----------------------------------------------------------

// 1) 값을 2개 전달 받아서 큰 값, 작은 값을 알려주는 함수

// 2) 정수를 넘기면 홀수인지, 짝수인지 알려주는 함수

// 3) 0, 1을 마구잡이로 5개 전달했을 때
// 0과 1의 개수를 알려주는 함수
// ex) myFunc(0, 1, 0, 0, 1)
// ex) 0의 개수 3개, 1의개수 2개

// ----------------------------------------------------------

// 1) 입력받은 3개 중 홀수만 모두 더해주는 함수

// 2) 입력받은 수까지 반복 후 짝수의 합을 모두 더해주는 함수

// 3) 입력한 값 중 a를 제거해주는 함수
// ex) "가a나a다a라a마a바" -> "가나다라마바"


// 4) 입력한 값이 실수인지 정수인지 알려주는 함수
// parseInt() : 정수로 바꿔주는 함수

// 5) 입력받은 문자를 뒤집어주는 함수
// ex) "abcdefg" -> "gfedcba";